app/controllers/images_controller.rb

  def index
    # display only the current user's images
    @allImages = current_user.images
    @images = @allImages.where(in_trash: false)
---
SELECT "images".* FROM "images"  WHERE "images"."user_id" = ? AND "images"."in_trash" = 'f'  [["user_id", 4]]

  def create
    @image = Image.new(image_params)

    # NOTE: populate with current user: (current user is
    # a built in devise function)
    @image.user = current_user

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("created_at", "picture", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-19 14:40:08.132035"], ["picture", "327425.jpg"], ["updated_at", "2014-10-19 14:40:08.132035"], ["user_id", 4]]

  def update
    respond_to do |format|
      if @image.update(image_params)
---
UPDATE "images" SET "updated_at" = ? WHERE "images"."id" = 39  [["updated_at", "2014-10-19 15:43:30.303345"]]

  def move_to_trash
    @image = Image.find(delete_params[:delete_image_id])
    @image.in_trash = 1
    @image.save
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 41]]
UPDATE "images" SET "in_trash" = ?, "updated_at" = ? WHERE "images"."id" = 41  [["in_trash", "t"], ["updated_at", "2014-10-19 15:36:12.592953"]]

  def trash
    @allImages = current_user.images
    @images = @allImages.where(in_trash: true)
---
SELECT "images".* FROM "images"  WHERE "images"."user_id" = ? AND "images"."in_trash" = 't'  [["user_id", 4]]

  def clear_trash
    @allImages = current_user.images
    @images = @allImages.where(in_trash: true).destroy_all
---
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 38]]
SELECT "images".* FROM "images"  WHERE "images"."user_id" = ? AND "images"."in_trash" = 't'  [["user_id", 1]]

  def share
    set_image

    # Users able to access the image
    @viewers = @image.viewers

    # List of potential users to share the image with
    @candidate_users = User.all.select {|user| user != current_user}
---
SELECT "users".* FROM "users"

  def create_share
    @image = Image.find(share_params[:shared_image_id])
    @share = SharedImage.new(share_params)
    @share.save
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 39]]
INSERT INTO "shared_images" ("created_at", "shared_image_id", "shared_user_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-19 14:44:12.340484"], ["shared_image_id", 39], ["shared_user_id", 1], ["updated_at", "2014-10-19 14:44:12.340484"]]

  def cancel_share
    @image = Image.find(share_params[:shared_image_id])
    @share = SharedImage.find_by(shared_user_id: share_params[:shared_user_id],
             shared_image_id: share_params[:shared_image_id])
    @share.destroy
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 39]]
SELECT  "shared_images".* FROM "shared_images"  WHERE "shared_images"."shared_user_id" = 1 AND "shared_images"."shared_image_id" = 39 LIMIT 1
DELETE FROM "shared_images" WHERE "shared_images"."id" = ?  [["id", 14]]

  def create_filt_copy

    @filter = filter_params[:filter_choice].to_s

    # Duplicate record and save to database
    @new = @image.dup
    @new.save

    # Re-upload image from local store
    @new.picture = @image.picture

    # Recreate tags
    @image.tag_list.each do |tag|
      @new.tag_list.add tag
    end

    # Apply filter and move from cache to local store
    @new.picture.send("#{@filter}_filter".to_sym)
    @new.save
---
INSERT INTO "images" ("created_at", "original_id", "picture", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-19 17:13:52.856514"], ["original_id", 39], ["picture", "327425.jpg"], ["updated_at", "2014-10-19 17:13:52.856514"], ["user_id", 4]]
SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('star') OR LOWER(name) = LOWER('love'))
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) + 1 WHERE "tags"."id" = 12

  def view_set
    @images = Image.where(original_id: @image.original_id, in_trash: false)
---
SELECT "images".* FROM "images"  WHERE "images"."original_id" = ? AND "images"."in_trash" = 'f'  [["original_id", 39]]

  def view_tagged
    @images = current_user.images.tagged_with(params[:tag]).where(in_trash: false)
---
SELECT "images".* FROM "images" JOIN taggings images_taggings_fdd5a49  ON images_taggings_fdd5a49.taggable_id = images.id AND images_taggings_fdd5a49.taggable_type = 'Image' AND images_taggings_fdd5a49.tag_id = 18 WHERE "images"."user_id" = ? AND "images"."in_trash" = 'f'  [["user_id", 1]]

  def download
    @image = Image.find(download_params[:download_image_id])
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 39]]

    def set_tags
      @tags = []
      if user_signed_in?
        current_user.images.where(in_trash: false).each do |i|
          i.tags.each {|tag| @tags << tag.name}
---
SELECT "images".* FROM "images"  WHERE "images"."user_id" = ? AND "images"."in_trash" = 'f'  [["user_id", 4]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "star"]]
SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('ny') OR LOWER(name) = LOWER('lots') OR LOWER(name) = LOWER('and') OR LOWER(name) = LOWER('of') OR LOWER(name) = LOWER('tags') OR LOWER(name) = LOWER('hey there'))