app/views/images/index.html.erb

SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('star'))
---
									<!-- the following line originates from: http://railscasts.com/episodes/382-tagging?view=asciicast -->
									<span>Tags: <%= raw image.tag_list.map { |t| link_to t, view_tagged_path(t) }.join(', ') %></span>